Naoki326/FramedPhoto/firmware/sdkconfig.defaults
# 目标芯片：ESP32-S3（好视达配套板）
CONFIG_IDF_TARGET="esp32s3"

# 基础配置
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash：16MB（配套板），双 OTA + storage 图片分区
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 调试
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 主任务栈适当放大，便于后续 HTTP 拉取
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_WIFI_ENABLE_SMARTCONFIG=y
